{
    "banner": {
        "paragraph1": "Hello I'm Nikola",
        "paragraph2": "Front-end Developer",
        "paragraph3": "Creative Front-end Developer with a knack for turning design visions into interactive and user-friendly websites. Recently graduated from Brainster's rigorous academy, where I mastered the art of coding. Eager to contribute my skills in crafting visually stunning and functionally robust digital experiences."
    },
    "services": {
        "subtitle1": "Responsive Web Design",
        "content1": "Elevate your website's visual appeal and functionality across devices with Responsive Web Design Optimization. Ensure seamless navigation and content adaptation for users on desktops, tablets, and mobiles. Deliver a consistent and engaging user experience, regardless of the screen size, and broaden your website's accessibility.",
        "subtitle2": "Performance Optimization",
        "content2": "Turbocharge your website's performance, streamline loading times, enhance user interactions, and boost overall efficiency. Implement cutting-edge techniques such as lazy loading and code splitting to ensure swift page loads. Elevate user satisfaction, improve search engine rankings, and keep visitors engaged with a lightning-fast website.",
        "subtitle3": "Custom Component",
        "content3": "Unleash the power of tailored front-end solutions with Custom Component Development. Craft unique, reusable UI components designed to fit your project's specific needs. From custom navigation bars to interactive widgets, I create modular, maintainable elements that ensure consistency, brand cohesion, and efficiency across your web application."
    },
    "about": {
        "title": "About me",
        "paragraph1": "Hi, I'm Nikola, a passionate programmer currently working at Makpetrol.",
        "paragraph2": "I recently completed the Front-End Academy at Brainster, where I honed my skills in HTML, CSS, JavaScript, and modern frameworks like React and Next.js. This intensive program not only enhanced my technical abilities but also deepened my understanding of user-centric design and development practices. Throughout my training and professional experiences, I have worked extensively with technologies and methodologies such as Scrum, AJAX, Sass, Git, Bootstrap, TailwindCSS, UX/UI, and jQuery.",
        "paragraph4": "In addition to my professional role, I am continually exploring new technologies and best practices to stay at the forefront of the industry. My commitment to continuous learning ensures that I can adapt to the rapidly evolving tech landscape and bring innovative solutions to the table.",
        "paragraph5": "When I'm not immersed in code, I enjoy pistol shooting, which helps me maintain a balanced and focused outlook on life. I also go to the gym, which further fuels my drive for excellence in everything I do.",
        "paragraph6": "I believe in the power of collaboration, creativity, and continuous improvement. My goal is to leverage my skills and experiences to create seamless and engaging digital experiences.",
        "paragraph7": "Feel free to explore my portfolio and reach out if you'd like to collaborate or just say hi!"
    },
    "projects": {
        "title": "Featured Projects",
        "name1": "Krik",
        "content1": "This one, the third and final real project from Academy, which we made it for Krik, their old one was hacked and ruined by hackers, and finally i am happy that i can help them with this new project, which was really interesting and given better look and experience for how one Project goes from zero to finish to be builded and deployed successfully, the hard work of this one was more interesting and fun, i really enjoyed while making this project, the project was made using Next.js, we had options to do the project with which framework we want, but for me Next.js looks more attractive. Krik is nongovernmental organization and nonprofit organization for young peoples, volunteers.",
        "name2": "Street Artists",
        "content2": "The second project of Academy, where i used more of JavaScript, it's an platform for Street Artists, where they can post, put their new arts on it, editing the same arts, remove them, put them in auction and someone who look for it, he can place bid for the art. It was interesting while doing this project, and I practiced more of JavaScript. The project was very helpful about understand the algorithm of often tasks in bigger applications.",
        "name3": "Portfolio",
        "content3": "My portfolio, for those who want to get to know me better with my experience that I offer, and in an opportunity to work together.",
        "name4": "Pet Shop",
        "content4": "The Pet Shop project is a place where pet owners can find everything they need for their pets to keep them in good health and ease the way they live together."
    }
}
